"""
个税计算模块
作者：张晓雷
日期：2020年4月21日
"""


# 个税计算方法不解释
# 我只是百度了一个看起来最牛b的代码copy了一下
# 个税怎么算不是我们今天要解决的核心问题
def calc(money):
    if money < 5000:
        tax = 0
    elif money <= 8000:
        tax = (money - 5000) * 3 / 100
    elif money <= 17000:
        tax = 3000 * 3 / 100 + (money - 5000 - 3000) * 0.1
    elif money <= 30000:
        tax = 3000 * 3 / 100 + 9000 * 0.1 + (money - 12000 - 5000) * 0.2
    elif money <= 40000:
        tax = 3000 * 3 / 100 + 9000 * 0.1 + 13000 * 0.2 + (money - 25000 - 5000) * 0.25
    elif money <= 60000:
        tax = 3000 * 3 / 100 + 9000 * 0.1 + 13000 * 0.2 + 10000 * 0.25 + (money - 35000 - 5000) * 0.3
    elif money <= 85000:
        tax = 3000 * 3 / 100 + 9000 * 0.1 + 13000 * 0.2 + 10000 * 0.25 + 20000 * 0.3 + (money - 55000 - 5000) * 0.35
    else:
        tax = 3000 * 3 / 100 + 9000 * 0.1 + 13000 * 0.2 + 10000 * 0.25 + 20000 * 0.3 + 25000 * 0.35 + (
                money - 85000) * 0.45
    return tax


if __name__ == "__main__":
    print(calc(6666))
